In [47]:
import pandas as pd
import numpy as np

In [3]:
disp_url = 'https://raw.githubusercontent.com/fenago/MLEssentials/main/datasets/disp.csv'
account_url = 'https://raw.githubusercontent.com/fenago/MLEssentials/main/datasets/account.csv'
client_url = 'https://raw.githubusercontent.com/fenago/MLEssentials/main/datasets/client.csv'
trans_url = './datasets/trans.csv'
# data can be found here: https://github.com/fenago/MLEssentials/tree/main/datasets

In [4]:
df_disp = pd.read_csv(disp_url, sep=';')
df_trans = pd.read_csv(trans_url, sep=';')
df_account = pd.read_csv(account_url, sep=';')
df_client = pd.read_csv(client_url, sep=';')

/opt/anaconda3/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3444: DtypeWarning: Columns (8) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [5]:
df_trans.head()

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account
0,695247,2378,930101,PRIJEM,VKLAD,700.0,700.0,NaN,NaN,NaN
1,171812,576,930101,PRIJEM,VKLAD,900.0,900.0,NaN,NaN,NaN
2,207264,704,930101,PRIJEM,VKLAD,1000.0,1000.0,NaN,NaN,NaN
3,1117247,3818,930101,PRIJEM,VKLAD,600.0,600.0,NaN,NaN,NaN
4,579373,1972,930102,PRIJEM,VKLAD,400.0,400.0,NaN,NaN,NaN

In [6]:
df_trans.shape

(1056320, 10)

In [7]:
df_account.head()

   account_id  district_id         frequency    date
0         576           55  POPLATEK MESICNE  930101
1        3818           74  POPLATEK MESICNE  930101
2         704           55  POPLATEK MESICNE  930101
3        2378           16  POPLATEK MESICNE  930101
4        2632           24  POPLATEK MESICNE  930102

In [8]:
df_trans_acc = pd.merge(df_trans, df_account, how='left', on='account_id')

In [9]:
df_trans_acc.shape

(1056320, 13)

In [10]:
df_disp.head()

   disp_id  client_id  account_id       type
0        1          1           1      OWNER
1        2          2           2      OWNER
2        3          3           2  DISPONENT
3        4          4           3      OWNER
4        5          5           3  DISPONENT

In [11]:
df_disp_owner = df_disp[df_disp['type'] == 'OWNER']

In [12]:
df_disp_owner.duplicated(subset='account_id').sum()

0

In [13]:
df_trans_acc_disp = pd.merge(df_trans_acc, df_disp_owner, how='left', on='account_id')
df_trans_acc_disp.shape

(1056320, 16)

In [14]:
df_client.head()

   client_id  birth_number  district_id
0          1        706213           18
1          2        450204            1
2          3        406009            1
3          4        561201            5
4          5        605703            5

In [15]:
df_client.sample(10)

      client_id  birth_number  district_id
4079       4310        255530           65
2402       2531        545124            5
139         149        480627           55
4744       5539        350605           74
389         410        621220           62
5275      12729        680321           36
3147       3323        815222           74
2374       2503        775923           54
4410       4665        265827            9
4221       4464        641119           53

In [16]:
df_merged = pd.merge(df_trans_acc_disp, df_client, how='left', on=['client_id', 'district_id'])
df_merged.shape

(1056320, 17)

In [17]:
df_merged.columns

Index(['trans_id', 'account_id', 'date_x', 'type_x', 'operation', 'amount',
       'balance', 'k_symbol', 'bank', 'account', 'district_id', 'frequency',
       'date_y', 'disp_id', 'client_id', 'type_y', 'birth_number'],
      dtype='object')

In [18]:
df_merged.rename(columns={'date_x': 'trans_date', 'type_x': 'trans_type', 'date_y':'account_creation', 'type_y':'client_type'}, inplace=True)

In [19]:
df_merged.head()

,trans_id,account_id,trans_date,trans_type,operation,amount,balance,k_symbol,bank,account,district_id,frequency,account_creation,disp_id,client_id,client_type,birth_number
0,695247,2378,930101,PRIJEM,VKLAD,700.0,700.0,NaN,NaN,NaN,16,POPLATEK MESICNE,930101,2873,2873,OWNER,755324.0
1,171812,576,930101,PRIJEM,VKLAD,900.0,900.0,NaN,NaN,NaN,55,POPLATEK MESICNE,930101,692,692,OWNER,NaN
2,207264,704,930101,PRIJEM,VKLAD,1000.0,1000.0,NaN,NaN,NaN,55,POPLATEK MESICNE,930101,844,844,OWNER,NaN
3,1117247,3818,930101,PRIJEM,VKLAD,600.0,600.0,NaN,NaN,NaN,74,POPLATEK MESICNE,930101,4601,4601,OWNER,NaN
4,579373,1972,930102,PRIJEM,VKLAD,400.0,400.0,NaN,NaN,NaN,77,POPLATEK MESICNE,930102,2397,2397,OWNER,NaN

In [20]:
df_merged.dtypes

trans_id              int64
account_id            int64
trans_date            int64
trans_type           object
operation            object
amount              float64
balance             float64
k_symbol             object
bank                 object
account             float64
district_id           int64
frequency            object
account_creation      int64
disp_id               int64
client_id             int64
client_type          object
birth_number        float64
dtype: object

In [21]:
# Start here with your merged data types

In [22]:
df_merged.head()

,trans_id,account_id,trans_date,trans_type,operation,amount,balance,k_symbol,bank,account,district_id,frequency,account_creation,disp_id,client_id,client_type,birth_number
0,695247,2378,930101,PRIJEM,VKLAD,700.0,700.0,NaN,NaN,NaN,16,POPLATEK MESICNE,930101,2873,2873,OWNER,755324.0
1,171812,576,930101,PRIJEM,VKLAD,900.0,900.0,NaN,NaN,NaN,55,POPLATEK MESICNE,930101,692,692,OWNER,NaN
2,207264,704,930101,PRIJEM,VKLAD,1000.0,1000.0,NaN,NaN,NaN,55,POPLATEK MESICNE,930101,844,844,OWNER,NaN
3,1117247,3818,930101,PRIJEM,VKLAD,600.0,600.0,NaN,NaN,NaN,74,POPLATEK MESICNE,930101,4601,4601,OWNER,NaN
4,579373,1972,930102,PRIJEM,VKLAD,400.0,400.0,NaN,NaN,NaN,77,POPLATEK MESICNE,930102,2397,2397,OWNER,NaN

In [23]:
df_merged.duplicated().sum()

0

In [24]:
#Transform the data type for date columns using .to_datetime().

In [28]:
df_merged['Date'] = pd.to_datetime(df_merged['trans_date'])

In [29]:
df_merged['Date']

0         1970-01-01 00:00:00.000930101
1         1970-01-01 00:00:00.000930101
2         1970-01-01 00:00:00.000930101
3         1970-01-01 00:00:00.000930101
4         1970-01-01 00:00:00.000930102
                       ...
1056315   1970-01-01 00:00:00.000981231
1056316   1970-01-01 00:00:00.000981231
1056317   1970-01-01 00:00:00.000981231
1056318   1970-01-01 00:00:00.000981231
1056319   1970-01-01 00:00:00.000981231
Name: Date, Length: 1056320, dtype: datetime64[ns]

In [30]:
df_merged.dtypes

trans_id                     int64
account_id                   int64
trans_date                   int64
trans_type                  object
operation                   object
amount                     float64
balance                    float64
k_symbol                    object
bank                        object
account                    float64
district_id                  int64
frequency                   object
account_creation             int64
disp_id                      int64
client_id                    int64
client_type                 object
birth_number               float64
Date                datetime64[ns]
dtype: object

In [31]:
df_merged['birth_number'].sample(20)

1014444    735518.0
470609     505108.0
745204     650318.0
872570     400319.0
802122     591128.0
116882     640828.0
930752     735410.0
892320     441215.0
708018     406104.0
3410       475601.0
106479     420101.0
835172     515324.0
1007820    421029.0
123663     750305.0
21972           NaN
163893     726227.0
955624          NaN
1002869    715324.0
344114     491013.0
815469     445612.0
Name: birth_number, dtype: float64

In [70]:
df['female'] = df['birth_number']

In [71]:
df_merged.sample(15)

,trans_id,account_id,trans_date,trans_type,operation,amount,balance,k_symbol,bank,account,district_id,frequency,account_creation,disp_id,client_id,client_type,birth_number,Date,female,male
1041037,330025,1125,981210,PRIJEM,VKLAD,5751.0,24617.0,NaN,NaN,NaN,1,POPLATEK TYDNE,971121,1350,1350,OWNER,590428.0,1970-01-01 00:00:00.000981210,750324.0,220720.0
774460,477508,1627,980131,VYDAJ,VYBER,14.6,34590.7,SLUZBY,NaN,NaN,1,POPLATEK MESICNE,940120,1972,1972,OWNER,465429.0,1970-01-01 00:00:00.000980131,750324.0,220720.0
870734,977041,3329,980531,VYDAJ,VYBER,14.6,45238.9,SLUZBY,NaN,NaN,3,POPLATEK MESICNE,961012,4024,4024,OWNER,641016.0,1970-01-01 00:00:00.000980531,750324.0,220720.0
228941,1062105,3629,951107,VYDAJ,PREVOD NA UCET,1894.0,19774.6,SIPO,CD,72661483.0,48,POPLATEK MESICNE,930727,4377,4377,OWNER,780131.0,1970-01-01 00:00:00.000951107,750324.0,220720.0
495577,3559324,882,970228,PRIJEM,NaN,77.1,17376.0,UROK,NaN,NaN,9,POPLATEK MESICNE,930306,1062,1062,OWNER,NaN,1970-01-01 00:00:00.000970228,750324.0,220720.0
795586,371717,1266,980228,VYDAJ,VYBER,14.6,29088.8,SLUZBY,NaN,NaN,57,POPLATEK MESICNE,960701,1528,1528,OWNER,640320.0,1970-01-01 00:00:00.000980228,750324.0,220720.0
862108,337586,1146,980513,VYDAJ,PREVOD NA UCET,3437.0,101361.4,SIPO,OP,77362507.0,67,POPLATEK MESICNE,930912,1378,1378,OWNER,NaN,1970-01-01 00:00:00.000980513,750324.0,220720.0
263744,27361,90,960116,VYDAJ,VYBER,2880.0,32784.7,NaN,NaN,NaN,1,POPLATEK MESICNE,940713,107,107,OWNER,720623.0,1970-01-01 00:00:00.000960116,750324.0,220720.0
198116,156737,524,950812,VYDAJ,PREVOD NA UCET,5768.0,28530.2,SIPO,AB,71994364.0,61,POPLATEK MESICNE,940503,630,630,OWNER,520303.0,1970-01-01 00:00:00.000950812,750324.0,220720.0
301310,971510,3310,960406,PRIJEM,PREVOD Z UCTU,4916.0,23855.5,DUCHOD,WX,39539855.0,25,POPLATEK MESICNE,930915,4002,4002,OWNER,205629.0,1970-01-01 00:00:00.000960406,750324.0,220720.0
649420,3592218,1869,970930,PRIJEM,NaN,321.7,75807.2,UROK,NaN,NaN,1,POPLATEK MESICNE,960614,2267,2267,OWNER,665410.0,1970-01-01 00:00:00.000970930,750324.0,220720.0
44453,7158,27,940309,VYDAJ,VYBER,4300.0,31555.5,NaN,NaN,NaN,73,POPLATEK MESICNE,930926,33,33,OWNER,486204.0,1970-01-01 00:00:00.000940309,750324.0,220720.0
140787,3565773,1071,950228,PRIJEM,NaN,148.8,48421.7,UROK,NaN,NaN,68,POPLATEK TYDNE,930510,1286,1286,OWNER,NaN,1970-01-01 00:00:00.000950228,750324.0,220720.0
2763,25396,83,930516,PRIJEM,VKLAD,6800.0,16526.0,NaN,NaN,NaN,26,POPLATEK MESICNE,930416,98,98,OWNER,NaN,1970-01-01 00:00:00.000930516,750324.0,220720.0
297675,3546865,490,960331,PRIJEM,NaN,60.6,14861.0,UROK,NaN,NaN,45,POPLATEK MESICNE,950523,589,589,OWNER,610917.0,1970-01-01 00:00:00.000960331,750324.0,220720.0